tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "osx-cross/avr"
tap "romkatv/powerlevel10k"
tap "zegervdv/zathura"
brew "python@3.13"
brew "python@3.12"
brew "adwaita-icon-theme"
brew "age"
brew "autopsy"
brew "avrdude"
brew "bash"
brew "bat"
brew "bc"
brew "bfg"
brew "bitwarden-cli"
brew "btop"
brew "certifi"
brew "chezmoi"
brew "cmake"
brew "cmake-docs"
brew "php"
brew "composer"
brew "coreutils"
brew "duf"
brew "eigen"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "ffsend"
brew "ncurses"
brew "fish"
brew "flyctl"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "glow"
brew "gnu-sed"
brew "go"
brew "gobuster"
brew "gotop"
brew "gtk4"
brew "pkgconf"
brew "hugo"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "john"
brew "jq"
brew "jupyterlab"
brew "lazygit"
brew "lilypond"
brew "llvm"
brew "lua"
brew "luarocks"
brew "make"
brew "ncdu"
brew "neovim"
brew "netcat"
brew "nmap"
brew "pipenv"
brew "pipx"
brew "pngpaste"
brew "poppler"
brew "powerlevel10k"
brew "pyqt@5"
brew "python-gdbm@3.12"
brew "python-gdbm@3.13"
brew "python-tk@3.12"
brew "python-tk@3.13"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "rustup"
brew "sevenzip"
brew "silicon"
brew "ta-lib"
brew "tldr"
brew "tmux"
brew "tor"
brew "tree"
brew "typst"
brew "unar"
brew "virtualenv"
brew "wget"
brew "wpscan"
brew "xclip"
brew "yara"
brew "yarn"
brew "yazi"
brew "zip"
brew "zmap"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "osx-cross/avr/avr-gcc@9"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "alfred"
cask "anki"
cask "anytype"
cask "appcleaner"
cask "appflowy"
cask "betterdiscord-installer"
cask "binary-ninja-free"
cask "bitwarden"
cask "brave-browser"
cask "calibre"
cask "cryptomator"
cask "crystalfetch"
cask "discord"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "grandperspective"
cask "gstreamer-runtime"
cask "jdownloader"
cask "kitty"
cask "libreoffice"
cask "librewolf"
cask "logi-options+"
cask "maccy"
cask "mactex"
cask "malwarebytes"
cask "mega"
cask "metasploit"
cask "mullvad-browser"
cask "mullvadvpn"
cask "musescore"
cask "notion"
cask "obs"
cask "obsidian"
cask "omnidisksweeper"
cask "onlyoffice"
cask "onyx"
cask "proton-drive"
cask "proton-mail"
cask "pycharm-ce"
cask "qbittorrent"
cask "rectangle"
cask "signal"
cask "skim"
cask "sony-ps-remote-play"
cask "standard-notes"
cask "steam"
cask "the-unarchiver"
cask "ticktick"
cask "tor-browser"
cask "utm"
cask "virtualbox"
cask "vlc"
cask "webex"
cask "wireshark"
cask "zoom"
