tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "osx-cross/avr"
tap "romkatv/powerlevel10k"
tap "zegervdv/zathura"
brew "adwaita-icon-theme"
brew "autopsy"
brew "avrdude"
brew "bash"
brew "bat"
brew "bc"
brew "bfg"
brew "chezmoi"
brew "cmake"
brew "cmake-docs"
brew "php"
brew "composer"
brew "coreutils"
brew "duf"
brew "eigen"
brew "eza"
brew "fd"
brew "gcc"
brew "ffmpeg"
brew "ffsend"
brew "flyctl"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "glow"
brew "gnu-sed"
brew "go"
brew "gobuster"
brew "gotop"
brew "gtk4"
brew "hugo"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "john"
brew "jq"
brew "jupyterlab"
brew "lazygit"
brew "lilypond"
brew "llvm"
brew "luarocks"
brew "make"
brew "ncurses"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "netcat"
brew "nmap"
brew "pipenv"
brew "pipx"
brew "pngpaste"
brew "poppler"
brew "powerlevel10k"
brew "pyqt@5"
brew "python@3.11"
brew "python-gdbm@3.11"
brew "python-tk@3.11"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "rustup-init"
brew "sevenzip"
brew "silicon"
brew "ta-lib"
brew "tldr"
brew "tmux"
brew "tor"
brew "tree"
brew "unar"
brew "virtualenv"
brew "wget"
brew "wireshark"
brew "wpscan"
brew "xclip"
brew "yara"
brew "yarn"
brew "zip"
brew "zmap"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "osx-cross/avr/avr-gcc@9"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "airserver"
cask "alfred"
cask "betterdiscord-installer"
cask "bitwarden"
cask "bluestacks"
cask "brave-browser"
cask "calibre"
cask "clion"
cask "discord"
cask "docker"
cask "elgato-game-capture-hd"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "gstreamer-runtime"
cask "iterm2"
cask "librewolf"
cask "maccy"
cask "mactex"
cask "malwarebytes"
cask "metasploit"
cask "mullvad-browser"
cask "musescore"
cask "obs"
cask "obsidian"
cask "onlyoffice"
cask "proton-drive"
cask "protonvpn"
cask "rectangle"
cask "skim"
cask "the-unarchiver"
cask "tor-browser"
cask "vlc"
cask "vmware-fusion"
cask "weka"
cask "wine-stable"
cask "xampp"
cask "zoom"
