tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "osx-cross/avr"
tap "romkatv/powerlevel10k"
tap "zegervdv/zathura"
brew "adwaita-icon-theme"
brew "aircrack-ng"
brew "apktool"
brew "arp-scan"
brew "autopsy"
brew "avrdude"
brew "bfg"
brew "gcc"
brew "python@3.11"
brew "binwalk"
brew "capstone"
brew "chezmoi"
brew "cmake"
brew "cmake-docs"
brew "php"
brew "composer"
brew "crunch"
brew "dc3dd"
brew "ddrescue"
brew "dex2jar"
brew "dns2tcp"
brew "dnsmap"
brew "dnstracer"
brew "dos2unix"
brew "eigen"
brew "ncurses"
brew "ettercap"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "glow"
brew "gnu-sed"
brew "go"
brew "gotop"
brew "gtk4"
brew "hugo"
brew "hydra"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "john"
brew "jq"
brew "jupyterlab"
brew "lazygit"
brew "lilypond"
brew "llvm"
brew "luarocks"
brew "lynis"
brew "neofetch"
brew "neovim"
brew "netcat"
brew "nikto"
brew "nmap"
brew "pipx"
brew "pngpaste"
brew "poppler"
brew "powerlevel10k"
brew "pyqt@5"
brew "python-gdbm@3.11"
brew "python-tk@3.11"
brew "qemu"
brew "reaver"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "rustup-init"
brew "sevenzip"
brew "silicon"
brew "sqlmap"
brew "ta-lib"
brew "tmux"
brew "tree"
brew "unar"
brew "wget"
brew "wpscan"
brew "xclip"
brew "yara"
brew "yarn"
brew "zip"
brew "zmap"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "osx-cross/avr/avr-gcc@9"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "airserver"
cask "alfred"
cask "anki"
cask "bitwarden"
cask "clion"
cask "discord"
cask "disk-inventory-x"
cask "docker"
cask "elgato-game-capture-hd"
cask "figma"
cask "firefox"
cask "font-hack-nerd-font"
cask "iterm2"
cask "maccy"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "multipatch"
cask "musescore"
cask "obs"
cask "obsidian"
cask "postman"
cask "rectangle"
cask "skim"
cask "spotify"
cask "the-unarchiver"
cask "vlc"
cask "vmware-fusion"
cask "weka"
cask "wine-stable"
cask "xampp"
cask "zoom"
