tap "asmvik/formulae", "https://github.com/asmvik/homebrew-formulae.git"
tap "domt4/autoupdate", "https://github.com/DomT4/homebrew-autoupdate.git"
tap "homebrew-zathura/zathura", "https://github.com/homebrew-zathura/homebrew-zathura.git"
tap "osx-cross/avr"
tap "romkatv/powerlevel10k"
tap "supabase/tap"
# Library for manipulating PNG images
brew "libpng"
# General-purpose data compression with high compression ratio
brew "xz"
# TIFF library and utilities
brew "libtiff"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Simple, modern, secure file encryption
brew "age"
# GNU Binutils for arm-none-eabi cross development
brew "arm-none-eabi-binutils"
# Graphical interface to Sleuth Kit investigation tools
brew "autopsy"
# Atmel AVR MCU programmer
brew "avrdude"
# Text-based UI library
brew "ncurses"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Arbitrary precision numeric processing language
brew "bc"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Emacs dependency management
brew "cask"
# Mozilla CA bundle for Python
brew "certifi"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# C++ template library for linear algebra
brew "eigen"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Fully featured Firefox Send client
brew "ffsend"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line tools for fly.io services
brew "flyctl"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Toolkit for creating graphical user interfaces
brew "gtk4"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Configurable static site generator
brew "hugo"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Featureful UNIX password cracker
brew "john"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Interactive environments for writing and running code
brew "jupyterlab"
# Simple terminal UI for git commands
brew "lazygit"
# Lets you manipulate the signature block in a Mach-O binary
brew "ldid"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Music engraving system
brew "lilypond"
# Next-gen compiler infrastructure
brew "llvm"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Port scanning utility for large networks
brew "nmap"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Paste PNG into files
brew "pngpaste"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Theme for zsh
brew "powerlevel10k"
# Monitor data's progress through a pipe
brew "pv"
# Python bindings for v5 of Qt
brew "pyqt@5"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Python interface to gdbm
brew "python-gdbm@3.12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Python interface to gdbm
brew "python-gdbm@3.13"
# Python interface to Tcl/Tk
brew "python-tk@3.12"
# Python interface to Tcl/Tk
brew "python-tk@3.13"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Rust toolchain installer
brew "rustup"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Create beautiful image of your source code
brew "silicon"
# Cross-shell prompt for astronauts
brew "starship"
# Open source continuous file synchronization application
brew "syncthing"
# Tools for market analysis
brew "ta-lib"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Anonymizing overlay network for TCP
brew "tor"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Markup-based typesetting system
brew "typst"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# Malware identification and classification tool
brew "yara"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Compression and file packaging/archive utility
brew "zip"
# Network scanner for Internet-wide network studies
brew "zmap"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# Professional graphic design software
cask "affinity-designer"
# Professional image editing software
cask "affinity-photo"
# Professional desktop publishing software
cask "affinity-publisher"
# Application launcher and productivity software
cask "alfred"
# Memory training application
cask "anki"
# Local-first and end-to-end encrypted notes app
cask "anytype"
# Application uninstaller
cask "appcleaner"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Web browser
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
# Pre-built GNU bare-metal toolchain for 32-bit Arm processors
cask "gcc-arm-embedded"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# GPU-based terminal emulator
cask "kitty"
# Web browser
cask "librewolf"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Clipboard manager
cask "maccy"
# Scan and remove malware, spyware, and viruses
cask "malwarebytes"
# Game Boy Advance emulator
cask "mgba-app"
# Web browser focused on privacy and on minimizing tracking and fingerprinting
cask "mullvad-browser"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Get up and running with large language models locally
cask "ollama-app"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# Document editor
cask "onlyoffice"
# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Desktop client for Proton Pass
cask "proton-pass"
# VPN client focusing on security
cask "protonvpn"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Instant messaging application focusing on security
cask "signal"
# PDF reader and note-taking application
cask "skim"
# Video game digital distribution service
cask "steam"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Unpacks archive files
cask "the-unarchiver"
# To-do & task list manager
cask "ticktick"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Gecko based web browser
cask "zen"
vscode "aaron-bond.better-comments"
vscode "astro-build.astro-vscode"
vscode "atlassian.atlascode"
vscode "bbenoist.doxygen"
vscode "bierner.markdown-mermaid"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "cschlosser.doxdocgen"
vscode "darkriszty.markdown-table-prettify"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "eric-blanquer.ansi-automatic-clean-viewer"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-pull-request-github"
vscode "humao.rest-client"
vscode "iliazeus.vscode-ansi"
vscode "jsynowiec.vscode-insertdatestring"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "neptunedesign.vs-sequential-number"
vscode "nrwl.angular-console"
vscode "oracle.sql-developer"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tomoki1207.pdf"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "webfreak.debug"
vscode "wraith13.zoombar-vscode"
vscode "yzane.markdown-pdf"
npm "typescript"
